dojo2.org
#+SETUPFILE: setup.org

#+TITLE: Dojo 2 - Elixir Concorrente

Segundo dia do dojo de Elixir para vermos a parte concorrente da linguagem.

#+BEGIN_QUOTE
*Atenção!*

Assume-se que a parte 1 já tenha sido feita pelos participantes.
#+END_QUOTE


* Onde paramos?

Na primeira parte vimos diversos tópicos relacionados ao lado sequencial do Elixir. São eles:

1. iex
   - Aprendemos a nos virar no shell para ver documentação, autocomplete e etc.
2. Tipos primitivos básicos
   - Numéricos: inteiros e flutuantes
   - Atoms
   - Strings (binárias e lista de caracteres)
   - Listas
   - Tuplas
   - Mapas
   - Listas keyword
3. Execução de scripts elixir com "elixir arquivo.exs"
4. Construtos de linguagens funcionais
   - Pattern matching
   - Funções anônimas
   - Recursão
   - Guards
5. Outros construtos da linguagem
   - "case"
   - "if" e "unless"
6. Tooling
   - Mix para criar projetos
   - Mix para executar os testes usando ExUnit
   - Hex.pm para genrenciar dependências

Olhando assim nem parece tanta coisa, mas já temos QUASE tudo o que precisamos para criar projetos simples. Nos exemplos vimos como modelar um usuário, encapsular funções em módulos e testar nossos módulos. Mas então o que falta? 

Primeiro faremos uma passada nas dependências entre módulos. Como eu importo uma função de outro módulo? Existe "namespace" em elixir?

Depois entraremos de cabeça na parte assíncrona.

* Dependências entre módulos

Usamos a seguinte sintaxe para definir dependências entre módulos:

#+BEGIN_SRC elixir :exports both

defmodule MeuModuloComDependencias do
  # Import elimina a necessidade do nome do Módulo para chamar suas funções
  import Float
  # Para evitar colisão de nomes, pode-se optar quais funções se quer importar
  import String, only: [upcase: 1]
  
  # Require importa as definições de macros (que não será nosso foco nessa parte)
  require Integer
  
  # Não precisamos usar String.upcase/1
  IO.puts upcase "serei caixa alta"
  IO.puts "Arredondando: #{floor 12.12}" 

  # Uma macro é uma função que tem acesso a estrutura de dados do código (AST)
  # Em Elixir, um exemplo é is_odd/1 do módulo Integer. Ele é uma macro para ser usado em guards.
  # Veremos macros em detalhes em uma outra parte
  IO.puts Integer.is_odd(3) # sem o require essa linha falha
end

#+END_SRC

Existe ainda outra forma de depender de outros módulos que é usando a palavra reservada "use". Com ela você importa o módulo em questão e "requer" suas macros. Há mais diferenças, mas veremos mais a frente em maiores detalhes.

#+BEGIN_SRC elixir

defmodule NaoTenhoFuncoes do
  use ExUnit # esta linha magicamente cria funções no meu módulo

  # ao "usar" ExUnit ganhamos esta função. Aqui simplesmente invocamos a função.
  test "sou uma função definida dinamicamente" do
    :ok
  end
end

#+END_SRC

* Processos

Se você olhar todos os módulos do Elixir, verá que nenhum trata de criação de Threads. Isso porque a VM é baseada na arquitetura de atores e mensagens. 


** Processos como atores

De fato, um ator é um processo leve e não uma thread. Este processo leve é tão importante que é um *primitivo da linguagem*. Vejamos alguns exemplos:

#+BEGIN_SRC elixir

# o módulo mais simples de todos
defmodule ImageComics do

  def hello(name), do: IO.puts "Hello #{name}"

end

# Ok, mas como o executamos assíncronamente?
# Basta chamar a função spawn

pid = spawn fn -> ImageComics.hello "Async" end
# esse comando irá exibir o retorno da chamada e um valor estranho.

IO.puts "#{inspect pid}" # -> mostra algo estranho como: #PID<0.54.0>
# isso é o identificador deste ator. 

# No nosso teste, criamos um processo executandoo "spawn" passando uma função anônima. Essa função foi executada em outro processo. Qual? O que mostramos o valor de seu PID (Process Identifier).
#+END_SRC

*** Exercícios

1. Abra um shell iex e vejam a documentação de spawn com "h spawn". Além de spawn/1 irá mostrar a documentação de spawn/3. Chama a função String.upcase/1 com o valor "caixa alta" de forma assíncrona.

2. Veja a documentação da função self/0.

