dojo2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Dojo 2 - Elixir Concorrente</title>
<!-- 2015-05-14 Qui 20:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Victor Oliveira Nascimento victor.nascimento AT concretesolutions DOT com DOT br" />
<link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-dark.min.css" />


</head>
<body>
<div id="content">
<h1 class="title">Dojo 2 - Elixir Concorrente</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Onde paramos?</a></li>
<li><a href="#sec-2">2. Dependências entre módulos</a></li>
<li><a href="#sec-3">3. Processos</a>
<ul>
<li><a href="#sec-3-1">3.1. Processos como atores</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Exercícios</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. Atores: check! Mensagens: ?</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Exercícios</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Estado com processos</a>
<ul>
<li><a href="#sec-4-1">4.1. Recursão para guardar estado</a></li>
<li><a href="#sec-4-2">4.2. (MatchError) no match of right hand side value: 3</a></li>
<li><a href="#sec-4-3">4.3. Escondendo nosso protocolo</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. Exercícios</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">5. Distribuição</a>
<ul>
<li><a href="#sec-5-1">5.1. O módulo Node</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1. Exercícios</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Segundo dia do dojo de Elixir para vermos a parte concorrente da linguagem.
</p>

<blockquote>
<p>
<b>Atenção!</b>
</p>

<p>
Assume-se que a parte 1 já tenha sido feita pelos participantes.
</p>
</blockquote>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Onde paramos?</h2>
<div class="outline-text-2" id="text-1">
<p>
Na primeira parte vimos diversos tópicos relacionados ao lado sequencial do Elixir. São eles:
</p>

<ol class="org-ol">
<li>iex
<ul class="org-ul">
<li>Aprendemos a nos virar no shell para ver documentação, autocomplete e etc.
</li>
</ul>
</li>
<li>Tipos primitivos básicos
<ul class="org-ul">
<li>Numéricos: inteiros e flutuantes
</li>
<li>Atoms
</li>
<li>Strings (binárias e lista de caracteres)
</li>
<li>Listas
</li>
<li>Tuplas
</li>
<li>Mapas
</li>
<li>Listas keyword
</li>
</ul>
</li>
<li>Execução de scripts elixir com "elixir arquivo.exs"
</li>
<li>Construtos de linguagens funcionais
<ul class="org-ul">
<li>Pattern matching
</li>
<li>Funções anônimas
</li>
<li>Recursão
</li>
<li>Guards
</li>
</ul>
</li>
<li>Outros construtos da linguagem
<ul class="org-ul">
<li>"case"
</li>
<li>"if" e "unless"
</li>
</ul>
</li>
<li>Tooling
<ul class="org-ul">
<li>Mix para criar projetos
</li>
<li>Mix para executar os testes usando ExUnit
</li>
<li>Hex.pm para genrenciar dependências
</li>
</ul>
</li>
</ol>

<p>
Olhando assim nem parece tanta coisa, mas já temos QUASE tudo o que precisamos para criar projetos simples. Nos exemplos vimos como modelar um usuário, encapsular funções em módulos e testar nossos módulos. Mas então o que falta? 
</p>

<p>
Primeiro faremos uma passada nas dependências entre módulos. Como eu importo uma função de outro módulo? Existe "namespace" em elixir?
</p>

<p>
Depois entraremos de cabeça na parte assíncrona.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Dependências entre módulos</h2>
<div class="outline-text-2" id="text-2">
<p>
Usamos a seguinte sintaxe para definir dependências entre módulos:
</p>

<div class="org-src-container">

<pre class="src src-elixir"><span style="color: #b4fa70;">defmodule</span> <span style="color: #8cc4ff;">MeuModuloComDependencias</span> <span style="color: #b4fa70;">do</span>
  <span style="color: #73d216;"># </span><span style="color: #73d216;">Import elimina a necessidade do nome do M&#243;dulo para chamar suas fun&#231;&#245;es</span>
  <span style="color: #b4fa70;">import</span> <span style="color: #8cc4ff;">Float</span>
  <span style="color: #73d216;"># </span><span style="color: #73d216;">Para evitar colis&#227;o de nomes, pode-se optar quais fun&#231;&#245;es se quer importar</span>
  <span style="color: #b4fa70;">import</span> <span style="color: #8cc4ff;">String</span>, <span style="color: #87cefa;">only:</span> [<span style="color: #87cefa;">upcase:</span> 1]

  <span style="color: #73d216;"># </span><span style="color: #73d216;">Require importa as defini&#231;&#245;es de macros (que n&#227;o ser&#225; nosso foco nessa parte)</span>
  <span style="color: #b4fa70;">require</span> <span style="color: #8cc4ff;">Integer</span>

  <span style="color: #73d216;"># </span><span style="color: #73d216;">N&#227;o precisamos usar String.upcase/1</span>
  <span style="color: #e9b2e3;">IO</span>.puts upcase <span style="color: #e9b96e;">"serei caixa alta"</span>
  <span style="color: #e9b2e3;">IO</span>.puts <span style="color: #e9b96e;">"Arredondando: </span><span style="color: #fcaf3e;">#{floor 12.12}</span><span style="color: #e9b96e;">"</span> 

  <span style="color: #73d216;"># </span><span style="color: #73d216;">Uma macro &#233; uma fun&#231;&#227;o que tem acesso a estrutura de dados do c&#243;digo (AST)</span>
  <span style="color: #73d216;"># </span><span style="color: #73d216;">Em Elixir, um exemplo &#233; is_odd/1 do m&#243;dulo Integer. Ele &#233; uma macro para ser usado em guards.</span>
  <span style="color: #73d216;"># </span><span style="color: #73d216;">Veremos macros em detalhes em uma outra parte</span>
  <span style="color: #e9b2e3;">IO</span>.puts <span style="color: #e9b2e3;">Integer</span>.is_odd(3) <span style="color: #73d216;"># </span><span style="color: #73d216;">sem o require essa linha falha</span>
<span style="color: #b4fa70;">end</span>
</pre>
</div>

<pre class="example">
SEREI CAIXA ALTA
Arredondando: 12.0
true
</pre>

<p>
Existe ainda outra forma de depender de outros módulos que é usando a palavra reservada "use". Com ela você importa o módulo em questão e "requer" suas macros. Há mais diferenças, mas veremos mais a frente em maiores detalhes.
</p>

<div class="org-src-container">

<pre class="src src-elixir"><span style="color: #b4fa70;">defmodule</span> <span style="color: #8cc4ff;">NaoTenhoFuncoes</span> <span style="color: #b4fa70;">do</span>
  <span style="color: #b4fa70;">use</span> <span style="color: #8cc4ff;">ExUnit</span> <span style="color: #73d216;"># </span><span style="color: #73d216;">esta linha magicamente cria fun&#231;&#245;es no meu m&#243;dulo</span>

  <span style="color: #73d216;"># </span><span style="color: #73d216;">ao "usar" ExUnit ganhamos esta fun&#231;&#227;o. Aqui simplesmente invocamos a fun&#231;&#227;o.</span>
  test <span style="color: #e9b96e;">"sou uma fun&#231;&#227;o definida dinamicamente"</span> <span style="color: #b4fa70;">do</span>
    <span style="color: #87cefa;">:ok</span>
  <span style="color: #b4fa70;">end</span>
<span style="color: #b4fa70;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Processos</h2>
<div class="outline-text-2" id="text-3">
<p>
Se você olhar todos os módulos do Elixir, verá que nenhum trata de criação de Threads. Isso porque a VM é baseada na arquitetura de atores e mensagens. 
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Processos como atores</h3>
<div class="outline-text-3" id="text-3-1">
<p>
De fato, um ator é um processo leve e não uma thread. Este processo leve é tão importante que é um <b>primitivo da linguagem</b>. Vejamos alguns exemplos:
</p>

<div class="org-src-container">

<pre class="src src-elixir"><span style="color: #73d216;"># </span><span style="color: #73d216;">o m&#243;dulo mais simples de todos</span>
<span style="color: #b4fa70;">defmodule</span> <span style="color: #8cc4ff;">ImageComics</span> <span style="color: #b4fa70;">do</span>

  <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">hello</span>(name), <span style="color: #87cefa;">do:</span> <span style="color: #e9b2e3;">IO</span>.puts <span style="color: #e9b96e;">"Hello </span><span style="color: #fcaf3e;">#{name}</span><span style="color: #e9b96e;">"</span>

<span style="color: #b4fa70;">end</span>

<span style="color: #73d216;"># </span><span style="color: #73d216;">Ok, mas como o executamos ass&#237;ncronamente?</span>
<span style="color: #73d216;"># </span><span style="color: #73d216;">Basta chamar a fun&#231;&#227;o spawn</span>

<span style="color: #fcaf3e;">pid</span> = spawn <span style="color: #b4fa70;">fn</span> -&gt; ImageComics.hello <span style="color: #e9b96e;">"Async"</span> <span style="color: #b4fa70;">end</span>
<span style="color: #73d216;"># </span><span style="color: #73d216;">esse comando ir&#225; exibir o retorno da chamada e um valor estranho.</span>

<span style="color: #e9b2e3;">IO</span>.puts <span style="color: #e9b96e;">"</span><span style="color: #fcaf3e;">#{inspect pid}</span><span style="color: #e9b96e;">"</span> <span style="color: #73d216;"># </span><span style="color: #73d216;">-&gt; mostra algo estranho como: #PID&lt;0.54.0&gt;</span>
<span style="color: #73d216;"># </span><span style="color: #73d216;">isso &#233; o identificador deste ator. </span>

<span style="color: #73d216;"># </span><span style="color: #73d216;">No nosso teste, criamos um processo executandoo "spawn" passando uma fun&#231;&#227;o an&#244;nima. Essa fun&#231;&#227;o foi executada em outro processo. Qual? O que mostramos o valor de seu PID (Process Identifier).</span>
</pre>
</div>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Exercícios</h4>
<div class="outline-text-4" id="text-3-1-1">
<ol class="org-ol">
<li>Abra um shell iex e vejam a documentação de spawn com "h spawn". Além de spawn/1 irá mostrar a documentação de spawn/3. Chama a função String.upcase/1 com o valor "caixa alta" de forma assíncrona.
</li>

<li>Veja a documentação da função self/0.
</li>
</ol>
</div>
</div>
</div>
