dojo2.org
** Atores: check! Mensagens: ?

Vimos como criar atores usando spawn. Aliás, atores nada mais são do que processos leves dentro da ErlangVM. No entanto, só vimos o efeito de criar um processo porque ele imprime no console uma mensagem. Não é nada lá muito útil né?

Para um processo se comunicar com outro ele precisa passar mensagens. Para isso usamos a função send e para "escutar" mensagens usamos a palavra reservada /receive/.

#+BEGIN_SRC elixir :exports both

  # A função send/2 recebe um PID e um termo qualquer. 

  # Primeiro vamos criar um processo que irá escutar mensagens. Depois passamos esse PID para a função send.

  pid = spawn fn -> 
    receive do
      # é boa prática (e muito comum em Erlang) colocar o PID de quem manda a mensagem
      # Assim conseguimos "devolver" o resultado
      {from, message} ->
        send from, {self, "Hello #{message}"}
    end
  end

  # até aqui ele não imprimiu nada... diferente do nosso primeiro exemplo.

  # Vamos enviar um hello! Precisamos do PID do shell iex.
  send pid, {self, "me, myself and I!"}

  # precisamos receber o resultado
  receive do
   {^pid, message} ->
      IO.puts message # vamos ver o que recebemos ...
  end
#+END_SRC

Simples não?

*** Exercícios

1. Crie um módulo PingPong. Ele irá ter uma função que criará um processo e ficará esperando mensagens do método ping. Queremos executar no shell o seguinte código:

  #+BEGIN_SRC elixir
    pid = PingPong.start # inicia um processo que ficará escutando mensagens de ping
    result = PingPong.ping pid # irá enviar uma mensagem "ping" para o pid e receberá "pong"
    IO.puts result # -> "pong"
  #+END_SRC

2. Usando o mesmo módulo, vamos criar uma função que envia uma mensagem /que não está sendo esperado pelo nosso processo/. Pode ser a mensagem "boom". Se tudo for de acordo com o plano, isso irá /travar/ o shell!!! Saia do shell com CTRL+C CTRL+C.

3. Altere nosso processo que escuta para ter uma cláusula que ignora mensagens desconhecidas.

* Estado com processos

Com o que já temos, conseguimos criar APIs assíncronas com pouquíssimo código. No entanto, temos um problema: cada processo só trata UMA mensagem. Nada muito bom, vamos alterar isso:

