dojo2.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Atores: check! Mensagens: ?</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Vimos como criar atores usando spawn. Aliás, atores nada mais são do que processos leves dentro da ErlangVM. No entanto, só vimos o efeito de criar um processo porque ele imprime no console uma mensagem. Não é nada lá muito útil né?
</p>

<p>
Para um processo se comunicar com outro ele precisa passar mensagens. Para isso usamos a função send e para "escutar" mensagens usamos a palavra reservada <i>receive</i>.
</p>

<div class="org-src-container">

<pre class="src src-elixir"><span style="color: #73d216;"># </span><span style="color: #73d216;">A fun&#231;&#227;o send/2 recebe um PID e um termo qualquer. </span>

<span style="color: #73d216;"># </span><span style="color: #73d216;">Primeiro vamos criar um processo que ir&#225; escutar mensagens. Depois passamos esse PID para a fun&#231;&#227;o send.</span>

<span style="color: #fcaf3e;">pid</span> = spawn <span style="color: #b4fa70;">fn</span> -&gt; 
  <span style="color: #b4fa70;">receive</span> <span style="color: #b4fa70;">do</span>
    <span style="color: #73d216;"># </span><span style="color: #73d216;">&#233; boa pr&#225;tica (e muito comum em Erlang) colocar o PID de quem manda a mensagem</span>
    <span style="color: #73d216;"># </span><span style="color: #73d216;">Assim conseguimos "devolver" o resultado</span>
    {from, message} -&gt;
      send from, {self, <span style="color: #e9b96e;">"Hello </span><span style="color: #fcaf3e;">#{message}</span><span style="color: #e9b96e;">"</span>}
  <span style="color: #b4fa70;">end</span>
<span style="color: #b4fa70;">end</span>

<span style="color: #73d216;"># </span><span style="color: #73d216;">at&#233; aqui ele n&#227;o imprimiu nada... diferente do nosso primeiro exemplo.</span>

<span style="color: #73d216;"># </span><span style="color: #73d216;">Vamos enviar um hello! Precisamos do PID do shell iex.</span>
send pid, {self, <span style="color: #e9b96e;">"me, myself and I!"</span>}

<span style="color: #73d216;"># </span><span style="color: #73d216;">precisamos receber o resultado</span>
<span style="color: #b4fa70;">receive</span> <span style="color: #b4fa70;">do</span>
 {^pid, message} -&gt;
    <span style="color: #e9b2e3;">IO</span>.puts message <span style="color: #73d216;"># </span><span style="color: #73d216;">vamos ver o que recebemos ...</span>
<span style="color: #b4fa70;">end</span>
</pre>
</div>

<pre class="example">
Hello me, myself and I!
</pre>

<p>
Simples não?
</p>
</div>

<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Exercícios</h4>
<div class="outline-text-4" id="text-3-2-1">
<ol class="org-ol">
<li>Crie um módulo PingPong. Ele irá ter uma função que criará um processo e ficará esperando mensagens do método ping. Queremos executar no shell o seguinte código:

<div class="org-src-container">

<pre class="src src-elixir"><span style="color: #fcaf3e;">pid</span> = PingPong.start <span style="color: #73d216;"># </span><span style="color: #73d216;">inicia um processo que ficar&#225; escutando mensagens de ping</span>
<span style="color: #fcaf3e;">result</span> = PingPong.ping pid <span style="color: #73d216;"># </span><span style="color: #73d216;">ir&#225; enviar uma mensagem "ping" para o pid e receber&#225; "pong"</span>
<span style="color: #e9b2e3;">IO</span>.puts result <span style="color: #73d216;"># </span><span style="color: #73d216;">-&gt; "pong"</span>
</pre>
</div>
</li>

<li>Usando o mesmo módulo, vamos criar uma função que envia uma mensagem <i>que não está sendo esperado pelo nosso processo</i>. Pode ser a mensagem "boom". Se tudo for de acordo com o plano, isso irá <i>travar</i> o shell!!! Saia do shell com CTRL+C CTRL+C.
</li>

<li>Altere nosso processo que escuta para ter uma cláusula que ignora mensagens desconhecidas.
</li>
</ol>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Estado com processos</h2>
<div class="outline-text-2" id="text-4">
<p>
Com o que já temos, conseguimos criar APIs assíncronas com pouquíssimo código. No entanto, temos um problema: cada processo só trata UMA mensagem. Nada muito bom, vamos alterar isso:
</p>
</div>
