dojo2.org
** Recursão para guardar estado

O problema que tivemos nos nossos exemplos anteriores é que nossa cláusula de receive executava apenas UMA vez. Como fazer para executar mais vezes? Recursão. A maioria das respostas em linguagens funcionais será recursão :D

Vejamos um exemplo:

#+BEGIN_SRC elixir :exports both

# módulo super criativo...
defmodule OlaMundo do

  def start lista_inicial do
    # usando spawn/3
      spawn __MODULE__, :loop, [lista_inicial]
  end

  def loop lista_de_pessoas do
    receive do

      # nas nossas cláusulas de receive, é boa prática colocarmos da mais específica para a menos.
      # neste caso é só e somente só quando recebermos o atom :terminar
      :terminar ->
        IO.puts "Terminando processo. Pessoas na lista: #{inspect lista_de_pessoas}"

      {from, :lista_de_pessoas} ->
        send from, {self, lista_de_pessoas}
        # até aqui tudo bem... nada de novo
        # porém queremos continuar recebendo mensagens. Basta efetuarmos a recursão!
        loop lista_de_pessoas    

      {from, pessoa} ->
        send from, {self, "Olá #{pessoa}"}
        # para guardar o estado, efetuamos a recursão com o NOVO estado que queremos.
        loop [ pessoa | lista_de_pessoas ]

      # cláusula genérica que apenas loga mensagens que não queremos.
      _ ->
        IO.puts "Ignorando mensagem"
        loop lista_de_pessoas
    end
  end

  # aqui encapsulamos aquilo que fazemos no shell para criar uma "api" para o nosso módulo.
  def ola(pid, pessoa) when is_binary(pessoa) do
    send pid, {self, pessoa}    
    receive do
      # estamos usando esse chapeuzinho antes da variável... por quê? Veja o bloco de atenção abaixo :D
      {^pid, mensagem} -> IO.puts mensagem
    after 
      15000 -> IO.puts "Sem olá para você" # um truque novo! Podemos ter timeouts para não travar o shell.

    end
  end

  def pessoas pid do
    send pid, {self, :lista_de_pessoas}    
    receive do
      {^pid, lista} -> Enum.each lista, &(IO.puts "Pessoa: #{&1}") # sintaxe nova !!!
    after 
     15000 -> IO.puts "Sem pessoas para você"
    end
  end

  def terminar pid do
    send pid, :terminar # acabou o loop!
  end
end

# Iniciando nosso ator
pid = OlaMundo.start []

# Executando nossas chamadas
OlaMundo.ola pid, "Fulano"
OlaMundo.ola pid, "Beltrano"
OlaMundo.ola pid, "Ciclano"

OlaMundo.pessoas pid

OlaMundo.terminar pid

OlaMundo.ola pid, "Fulano" # timeout!
#+END_SRC

Esse código é praticamente uma biblioteca de OláMundo distribuído... 

Reparem que estamos guardando estado de forma assíncrona com /recursão/. Vida longa ao Church!

#+BEGIN_QUOTE
/IMPORTANTE/

Sempre que fizermos uma recursão para guardar estado precisamos GARANTIR que a chamada para a função que faz a recursão é a /ÚLTIMA/.

Isso porque caso contrário teremos problemas com o nosso stack. Vejam um exemplo de chamada que não otimiza a recursão.

def fact(1), do: 1
def fact(n), do: n * fact(n -1)

Neste caso é preciso fazer uma multiplicação para saber o resultado e, portanto, não há uma recursão otimizada. Para corrigir este caso usamos um acumulador:

def fact(1), do: 1
def fact(n), do: fact(n, 0)

defp fact(1, acc), do: acc
defp fact(n, acc), do: fact(n - 1, n * acc)

A diferença é pequena porém muito importante.
#+END_QUOTE


#+BEGIN_QUOTE
/Atenção!/

Usamos o circunflexo para garantir que só aceitaremos se o valor for /IDÊNTICO/. Vejam um exemplo:

iex(1)> a = 1
1
iex(2)> a = 2
2
iex(3)> ^a = 3
** (MatchError) no match of right hand side value: 3

#+END_QUOTE


** Escondendo nosso protocolo

Vimos que temos que passar o PID sempre para as nossas funções. Porém, há uma forma de evitarmos até mesmo isso. Assim teremos uma verdadeira API que ninguém nem precisa saber que é assíncrona. Para isso, só precisamos passar opções para a criação do processo para que ele fique registrado com um "nome". Fazemos assim:

#+BEGIN_SRC elixir

pid = spawn Mod, :function, [args]
Process.register pid, :a_very_beautiful_name
#+END_SRC

Dessa forma conseguimos passar :a_very_beautiful_name no lugar do pid nas mensagens! Ficamos com APIs como:

#+BEGIN_SRC elixir
OlaMundo.start []
OlaMundo.ola "Fulano" # executa em outro processo!
OlaMundo.pessoas # executa em outro processo!
OlaMundo.terminar # executa em outro processo!
#+END_SRC

Para deixar ainda mais bonito, podemos assumir que o parâmetro lista_de_pessoas na função start/0 tenha um valor padrão. Para isso usamos a notação "\\". Vejam um exemplo de definição

#+BEGIN_SRC elixir :exports both

defmodule ValorDefault do
  def start lista \\ [] do
    # lista não é mais um parâmetro obrigatório!
    lista
  end
end

IO.puts "#{inspect ValorDefault.start}"
#+END_SRC

