dojo2.html

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Recursão para guardar estado</h3>
<div class="outline-text-3" id="text-4-1">
<p>
O problema que tivemos nos nossos exemplos anteriores é que nossa cláusula de receive executava apenas UMA vez. Como fazer para executar mais vezes? Recursão. A maioria das respostas em linguagens funcionais será recursão :D
</p>

<p>
Vejamos um exemplo:
</p>

<div class="org-src-container">

<pre class="src src-elixir"><span style="color: #73d216;"># </span><span style="color: #73d216;">m&#243;dulo super criativo...</span>
<span style="color: #b4fa70;">defmodule</span> <span style="color: #8cc4ff;">OlaMundo</span> <span style="color: #b4fa70;">do</span>

  <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">start</span> lista_inicial <span style="color: #b4fa70;">do</span>
    <span style="color: #73d216;"># </span><span style="color: #73d216;">usando spawn/3</span>
      spawn <span style="color: #e9b2e3;">__MODULE__</span>, <span style="color: #87cefa;">:loop</span>, [lista_inicial]
  <span style="color: #b4fa70;">end</span>

  <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">loop</span> lista_de_pessoas <span style="color: #b4fa70;">do</span>
    <span style="color: #b4fa70;">receive</span> <span style="color: #b4fa70;">do</span>
      <span style="color: #73d216;"># </span><span style="color: #73d216;">nas nossas cl&#225;usulas de receive, &#233; boa pr&#225;tica colocarmos da mais espec&#237;fica para a menos.</span>
      <span style="color: #73d216;"># </span><span style="color: #73d216;">neste caso &#233; s&#243; e somente s&#243; quando recebermos o atom :terminar</span>
      <span style="color: #87cefa;">:terminar</span> -&gt;
  <span style="color: #e9b2e3;">IO</span>.puts <span style="color: #e9b96e;">"Terminando processo. Pessoas na lista: </span><span style="color: #fcaf3e;">#{inspect lista_de_pessoas}</span><span style="color: #e9b96e;">"</span>

      {from, <span style="color: #87cefa;">:lista_de_pessoas</span>} -&gt;
  send from, {self, lista_de_pessoas}
  <span style="color: #73d216;"># </span><span style="color: #73d216;">at&#233; aqui tudo bem... nada de novo</span>
  <span style="color: #73d216;"># </span><span style="color: #73d216;">por&#233;m queremos continuar recebendo mensagens. Basta efetuarmos a recurs&#227;o!</span>
  loop lista_de_pessoas    

      {from, pessoa} -&gt;
  send from, {self, <span style="color: #e9b96e;">"Ol&#225; </span><span style="color: #fcaf3e;">#{pessoa}</span><span style="color: #e9b96e;">"</span>}
  <span style="color: #73d216;"># </span><span style="color: #73d216;">para guardar o estado, efetuamos a recurs&#227;o com o NOVO estado que queremos.</span>
  loop [ pessoa | lista_de_pessoas ]

      <span style="color: #73d216;"># </span><span style="color: #73d216;">cl&#225;usula gen&#233;rica que apenas loga mensagens que n&#227;o queremos.</span>
      <span style="color: #e9b2e3;">_</span> -&gt;
  <span style="color: #e9b2e3;">IO</span>.puts <span style="color: #e9b96e;">"Ignorando mensagem"</span>
  loop lista_de_pessoas
    <span style="color: #b4fa70;">end</span>
  <span style="color: #b4fa70;">end</span>

  <span style="color: #73d216;"># </span><span style="color: #73d216;">aqui encapsulamos aquilo que fazemos no shell para criar uma "api" para o nosso m&#243;dulo.</span>
  <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">ola</span>(pid, pessoa) <span style="color: #b4fa70;">when</span> is_binary(pessoa) <span style="color: #b4fa70;">do</span>
    send pid, {self, pessoa}    
    <span style="color: #b4fa70;">receive</span> <span style="color: #b4fa70;">do</span>
      <span style="color: #73d216;"># </span><span style="color: #73d216;">estamos usando esse chapeuzinho antes da vari&#225;vel... por qu&#234;? Veja o bloco de aten&#231;&#227;o abaixo :D</span>
      {^pid, mensagem} -&gt; <span style="color: #e9b2e3;">IO</span>.puts mensagem
    <span style="color: #b4fa70;">after</span> 
      15000 -&gt; <span style="color: #e9b2e3;">IO</span>.puts <span style="color: #e9b96e;">"Sem ol&#225; para voc&#234;"</span> <span style="color: #73d216;"># </span><span style="color: #73d216;">um truque novo! Podemos ter timeouts para n&#227;o travar o shell.</span>
    <span style="color: #b4fa70;">end</span>
  <span style="color: #b4fa70;">end</span>

  <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">pessoas</span> pid <span style="color: #b4fa70;">do</span>
    send pid, {self, <span style="color: #87cefa;">:lista_de_pessoas</span>}    
    <span style="color: #b4fa70;">receive</span> <span style="color: #b4fa70;">do</span>
      {^pid, lista} -&gt; <span style="color: #e9b2e3;">Enum</span>.each lista, &amp;(<span style="color: #e9b2e3;">IO</span>.puts <span style="color: #e9b96e;">"Pessoa: </span><span style="color: #fcaf3e;">#{&amp;1}</span><span style="color: #e9b96e;">"</span>) <span style="color: #73d216;"># </span><span style="color: #73d216;">sintaxe nova !!!</span>
    <span style="color: #b4fa70;">after</span> 
     15000 -&gt; <span style="color: #e9b2e3;">IO</span>.puts <span style="color: #e9b96e;">"Sem pessoas para voc&#234;"</span>
    <span style="color: #b4fa70;">end</span>
  <span style="color: #b4fa70;">end</span>

  <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">terminar</span> pid <span style="color: #b4fa70;">do</span>
    send pid, <span style="color: #87cefa;">:terminar</span> <span style="color: #73d216;"># </span><span style="color: #73d216;">acabou o loop!</span>
  <span style="color: #b4fa70;">end</span>
<span style="color: #b4fa70;">end</span>

<span style="color: #73d216;"># </span><span style="color: #73d216;">Iniciando nosso ator</span>
<span style="color: #fcaf3e;">pid</span> = OlaMundo.start []

<span style="color: #73d216;"># </span><span style="color: #73d216;">Executando nossas chamadas</span>
OlaMundo.ola pid, <span style="color: #e9b96e;">"Fulano"</span>
OlaMundo.ola pid, <span style="color: #e9b96e;">"Beltrano"</span>
OlaMundo.ola pid, <span style="color: #e9b96e;">"Ciclano"</span>

<span style="color: #73d216;"># </span><span style="color: #73d216;">Listando todas as pessoas</span>
OlaMundo.pessoas pid
<span style="color: #73d216;"># </span><span style="color: #73d216;">Matando o ator </span>
OlaMundo.terminar pid

OlaMundo.ola pid, <span style="color: #e9b96e;">"Fulano"</span> <span style="color: #73d216;"># </span><span style="color: #73d216;">timeout!</span>
</pre>
</div>

<pre class="example">
Olá Fulano
Olá Beltrano
Olá Ciclano
Pessoa: Ciclano
Pessoa: Beltrano
Pessoa: Fulano
Terminando processo. Pessoas na lista: ["Ciclano", "Beltrano", "Fulano"]
Sem olá para você
</pre>

<p>
Esse código é praticamente uma biblioteca de OláMundo distribuído&#x2026; 
</p>

<p>
Reparem que estamos guardando estado de forma assíncrona com <i>recursão</i>. Vida longa ao Church!
</p>

<blockquote>
<p>
<i>IMPORTANTE</i>
</p>

<p>
Sempre que fizermos uma recursão para guardar estado precisamos GARANTIR que a chamada para a função que faz a recursão é a <i>ÚLTIMA</i>.
</p>

<p>
Isso porque caso contrário teremos problemas com o nosso stack. Vejam um exemplo de chamada que não otimiza a recursão.
</p>

<p>
def fact(1), do: 1
def fact(n), do: n * fact(n -1)
</p>

<p>
Neste caso é preciso fazer uma multiplicação para saber o resultado e, portanto, não há uma recursão otimizada. Para corrigir este caso usamos um acumulador:
</p>

<p>
def fact(1), do: 1
def fact(n), do: fact(n, 0)
</p>

<p>
defp fact(1, acc), do: acc
defp fact(n, acc), do: fact(n - 1, n * acc)
</p>

<p>
A diferença é pequena porém muito importante.
</p>
</blockquote>

<p>
#+BEGIN_QUOTE
<i>Atenção!</i>
</p>

<p>
Usamos o circunflexo para garantir que só aceitaremos se o valor for <i>IDÊNTICO</i>. Vejam um exemplo:
</p>

<p>
iex(1)&gt; a = 1
1
iex(2)&gt; a = 2
2
iex(3)&gt; ^a = 3
</p>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> (MatchError) no match of right hand side value: 3</h3>
<div class="outline-text-3" id="text-4-2">
<p>
#+END_QUOTE
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Escondendo nosso protocolo</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Vimos que temos que passar o PID sempre para as nossas funções. Porém, há uma forma de evitarmos até mesmo isso. Assim teremos uma verdadeira API que ninguém nem precisa saber que é assíncrona. Para isso, só precisamos passar opções para a criação do processo para que ele fique registrado com um "nome". Fazemos assim:
</p>

<div class="org-src-container">

<pre class="src src-elixir"><span style="color: #fcaf3e;">pid</span> = spawn Mod, <span style="color: #87cefa;">:function</span>, [args]
<span style="color: #e9b2e3;">Process</span>.register pid, <span style="color: #87cefa;">:a_very_beautiful_name</span>
</pre>
</div>

<p>
Dessa forma conseguimos passar :a_very_beautiful_name no lugar do pid nas mensagens! Ficamos com APIs como:
</p>

<div class="org-src-container">

<pre class="src src-elixir">OlaMundo.start []
OlaMundo.ola <span style="color: #e9b96e;">"Fulano"</span> <span style="color: #73d216;"># </span><span style="color: #73d216;">executa em outro processo!</span>
OlaMundo.pessoas <span style="color: #73d216;"># </span><span style="color: #73d216;">executa em outro processo!</span>
OlaMundo.terminar <span style="color: #73d216;"># </span><span style="color: #73d216;">executa em outro processo!</span>
</pre>
</div>

<p>
Para deixar ainda mais bonito, podemos assumir que o parâmetro lista_de_pessoas na função start/0 tenha um valor padrão. Para isso usamos a notação "\\". Vejam um exemplo de definição
</p>

<div class="org-src-container">

<pre class="src src-elixir"><span style="color: #b4fa70;">defmodule</span> <span style="color: #8cc4ff;">ValorDefault</span> <span style="color: #b4fa70;">do</span>
  <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">start</span> lista \\ [] <span style="color: #b4fa70;">do</span>
    <span style="color: #73d216;"># </span><span style="color: #73d216;">lista n&#227;o &#233; mais um par&#226;metro obrigat&#243;rio!</span>
    lista
  <span style="color: #b4fa70;">end</span>
<span style="color: #b4fa70;">end</span>

<span style="color: #e9b2e3;">IO</span>.puts <span style="color: #e9b96e;">"</span><span style="color: #fcaf3e;">#{inspect ValorDefault.start}</span><span style="color: #e9b96e;">"</span>
</pre>
</div>

<pre class="example">
[]
</pre>
</div>
