dojo2.org
*** Exercícios

1. Refatore nosso OlaMundo para esconder a necessidade do pid e use o valor default da lista vazia na função start.
2. Crie um módulo Geladeira. Ele deve ter:
  - Uma função inicia: criará um processo e o registrará como Geladeira. O estado inicial deve ser uma lista vazia.
  - Uma função guarda_comida que receberá uma comida (uma string) e verificará se já existe ne geladeira. Caso exista devolve uma mensagem "já está na geladeira", caso contrário irá efetuar a recursão guardando a comida na lista.
  - Uma função pega_comida que verifica se a comida existe. Caso positivo retorna a comida e a remove da lista. Caso negativo retornar mensagem "Não há #{comida}". Para este exercício, verifiquem a documentação da função Enum.member?. 
  - Uma função terminar que encerra o processo.

* Distribuição

Vimos até agora como criar atores concorrentes que se comunicam com mensagens. Mas a promessa do Erlang é desenvolvimento "distribuído". Será que conseguimos usar nosso módulo de Geladeira para fazer um deploy remoto?

** O módulo Node

Primeiro precisamos ver as ferramentas nativas da plataforma. Abram um shell e vejam as funções do módulo Node. Temos o seguinte:

#+BEGIN_SRC sh
iex(nascimento@cs)26> Node.
alive?/0        connect/1       disconnect/1    get_cookie/0    
list/0          list/1          monitor/2       monitor/3       
ping/1          self/0          set_cookie/2    spawn/2         
spawn/3         spawn/4         spawn/5         spawn_link/2    
spawn_link/4    start/3         stop/0          
#+END_SRC

A maioria é alto explicativo. Podemos listar, conectar, testar uma conexão com ping e etc tudo entre nós em um cluster. 

Reparem no entanto que o exemplo mostra uma linha de iex diferente. "iex(nascimento@cs)". Qué pasa?

O que há de diferente é que este shell foi iniciado em modo "distribuído". Para isso foi executada a seguinte instrução:

#+BEGIN_SRC sh
iex --name nascimento@cs
#+END_SRC

Dessa forma damos um "nome" para o nó o que faz com que o sistema inicie em modo "distribuído". Só com isso já conseguimos fazer um cluster?

Vamos tentar (mas a resposta é não...).

Tentem conectar neste nó usando o seguinte comando no shell:

#+BEGIN_SRC elixir
Node.ping :"nascimento@cs"
#+END_SRC

Deve demorar um pouco (depende das partições de rede), mas a resposta será um educado "pang". Do outro lado da conexão aparecerá uma mensagem parecida com "tentativa de conexão de nó desautorizado". 

E como autorizar um nó? O mecanismo de autenticação é simples: há um cookie em cada instalação do erlang. Ao iniciar um nó em modo distribuído podemos verificar qual o valor do nosso cookie com Node.get_cookie/0. Mais do que isso, podemos mudar o valor padrão. Por exemplo:

#+BEGIN_SRC elixir
Node.set_cookie :qualquer_valor_em_um_atom
#+END_SRC

Pronto! Se o cookie for igual nos dois nós, a conexão será autorizada.

*** Exercícios

1. Iremos executar nosso módulo Geladeira de forma distribuída. Primeiramente inicie um shell com o parâmetro --name nome@<ip do servidor>. (lembrem qual o diretório que vocês estão iniciando o shell!!!!)
2. Ajuste o valor do cookie de seu nó para :coders_on_beers
3. Vamos conectar: execute Node.ping :"nascimento@<ip do servidor>"
4. Agora, vamos testar funções distribuídas. Criem um módulo em um arquivo ola_mundo_distribuido.ex (no mesmo diretório do shell!!!):

#+BEGIN_SRC elixir

defmodule OlaMundoClient do

  def ola(node, pessoa) when is_binary(pessoa) do
    send {:ola_mundo, node}, {self, pessoa}    
    receive do
      # estamos usando esse chapeuzinho antes da variável... por quê? Veja o bloco de atenção abaixo :D
      {pid, mensagem} -> IO.puts mensagem
    after 
      15000 -> IO.puts "Sem olá para você" # um truque novo! Podemos ter timeouts para não travar o shell.
    end
  end

  def pessoas node do
    send {:ola_mundo, node}, {self, :lista_de_pessoas}    
    receive do
      {pid, lista} -> Enum.each lista, &(IO.puts "Pessoa: #{&1}") # sintaxe nova !!!
    after 
     15000 -> IO.puts "Sem pessoas para você"
    end
  end

end

#+END_SRC

5. Na sua sessão de shell, use a função c para compilar o arquivo. (veja a documentação com "h c").
6. Executem as funções distribuídas: OlaMundoClient.ola :"nascimento@cs", "<NOME>" e OlaMundoClient.pessoas :"nascimento@cs".

>>>>>>> master
