dojo2.html

<div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> Exercícios</h4>
<div class="outline-text-4" id="text-4-3-1">
<ol class="org-ol">
<li>Refatore nosso OlaMundo para esconder a necessidade do pid e use o valor default da lista vazia na função start.
</li>
<li>Crie um módulo Geladeira. Ele deve ter:
<ul class="org-ul">
<li>Uma função inicia: criará um processo e o registrará como Geladeira. O estado inicial deve ser uma lista vazia.
</li>
<li>Uma função guarda_comida que receberá uma comida (uma string) e verificará se já existe ne geladeira. Caso exista devolve uma mensagem "já está na geladeira", caso contrário irá efetuar a recursão guardando a comida na lista.
</li>
<li>Uma função pega_comida que verifica se a comida existe. Caso positivo retorna a comida e a remove da lista. Caso negativo retornar mensagem "Não há #{comida}". Para este exercício, verifiquem a documentação da função Enum.member?. 
</li>
<li>Uma função terminar que encerra o processo.
</li>
</ul>
</li>
</ol>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Distribuição</h2>
<div class="outline-text-2" id="text-5">
<p>
Vimos até agora como criar atores concorrentes que se comunicam com mensagens. Mas a promessa do Erlang é desenvolvimento "distribuído". Será que conseguimos usar nosso módulo de Geladeira para fazer um deploy remoto?
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> O módulo Node</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Primeiro precisamos ver as ferramentas nativas da plataforma. Abram um shell e vejam as funções do módulo Node. Temos o seguinte:
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #fce94f;">iex</span>(nascimento@cs)26&gt; Node.
alive?/0        connect/1       disconnect/1    get_cookie/0    
list/0          list/1          monitor/2       monitor/3       
ping/1          self/0          set_cookie/2    spawn/2         
spawn/3         spawn/4         spawn/5         spawn_link/2    
spawn_link/4    start/3         stop/0
</pre>
</div>

<p>
A maioria é alto explicativo. Podemos listar, conectar, testar uma conexão com ping e etc tudo entre nós em um cluster. 
</p>

<p>
Reparem no entanto que o exemplo mostra uma linha de iex diferente. "iex(nascimento@cs)". Qué pasa?
</p>

<p>
O que há de diferente é que este shell foi iniciado em modo "distribuído". Para isso foi executada a seguinte instrução:
</p>

<div class="org-src-container">

<pre class="src src-sh">iex --name nascimento@cs
</pre>
</div>

<p>
Dessa forma damos um "nome" para o nó o que faz com que o sistema inicie em modo "distribuído". Só com isso já conseguimos fazer um cluster?
</p>

<p>
Vamos tentar (mas a resposta é não&#x2026;).
</p>

<p>
Tentem conectar neste nó usando o seguinte comando no shell:
</p>

<div class="org-src-container">

<pre class="src src-elixir"><span style="color: #e9b2e3;">Node</span>.ping :<span style="color: #e9b96e;">"nascimento@cs"</span>
</pre>
</div>

<p>
Deve demorar um pouco (depende das partições de rede), mas a resposta será um educado "pang". Do outro lado da conexão aparecerá uma mensagem parecida com "tentativa de conexão de nó desautorizado". 
</p>

<p>
E como autorizar um nó? O mecanismo de autenticação é simples: há um cookie em cada instalação do erlang. Ao iniciar um nó em modo distribuído podemos verificar qual o valor do nosso cookie com Node.get_cookie/0. Mais do que isso, podemos mudar o valor padrão. Por exemplo:
</p>

<div class="org-src-container">

<pre class="src src-elixir"><span style="color: #e9b2e3;">Node</span>.set_cookie <span style="color: #87cefa;">:qualquer_valor_em_um_atom</span>
</pre>
</div>

<p>
Pronto! Se o cookie for igual nos dois nós, a conexão será autorizada.
</p>
</div>

<div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> Exercícios</h4>
<div class="outline-text-4" id="text-5-1-1">
<ol class="org-ol">
<li>Iremos executar nosso módulo Geladeira de forma distribuída. Primeiramente inicie um shell com o parâmetro &#x2013;name nome@&lt;ip do servidor&gt;. (lembrem qual o diretório que vocês estão iniciando o shell!!!!)
</li>
<li>Ajuste o valor do cookie de seu nó para :coders_on_beers
</li>
<li>Vamos conectar: execute Node.ping :"nascimento@&lt;ip do servidor&gt;"
</li>
<li>Agora, vamos testar funções distribuídas. Criem um módulo em um arquivo ola_mundo_distribuido.ex (no mesmo diretório do shell!!!):
</li>
</ol>

<div class="org-src-container">

<pre class="src src-elixir"><span style="color: #b4fa70;">defmodule</span> <span style="color: #8cc4ff;">OlaMundoClient</span> <span style="color: #b4fa70;">do</span>

  <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">ola</span>(node, pessoa) <span style="color: #b4fa70;">when</span> is_binary(pessoa) <span style="color: #b4fa70;">do</span>
    send {<span style="color: #87cefa;">:ola_mundo</span>, node}, {self, pessoa}    
    <span style="color: #b4fa70;">receive</span> <span style="color: #b4fa70;">do</span>
      <span style="color: #73d216;"># </span><span style="color: #73d216;">estamos usando esse chapeuzinho antes da vari&#225;vel... por qu&#234;? Veja o bloco de aten&#231;&#227;o abaixo :D</span>
      {pid, mensagem} -&gt; <span style="color: #e9b2e3;">IO</span>.puts mensagem
    <span style="color: #b4fa70;">after</span> 
      15000 -&gt; <span style="color: #e9b2e3;">IO</span>.puts <span style="color: #e9b96e;">"Sem ol&#225; para voc&#234;"</span> <span style="color: #73d216;"># </span><span style="color: #73d216;">um truque novo! Podemos ter timeouts para n&#227;o travar o shell.</span>
    <span style="color: #b4fa70;">end</span>
  <span style="color: #b4fa70;">end</span>

  <span style="color: #b4fa70;">def</span> <span style="color: #fce94f;">pessoas</span> node <span style="color: #b4fa70;">do</span>
    send {<span style="color: #87cefa;">:ola_mundo</span>, node}, {self, <span style="color: #87cefa;">:lista_de_pessoas</span>}    
    <span style="color: #b4fa70;">receive</span> <span style="color: #b4fa70;">do</span>
      {pid, lista} -&gt; <span style="color: #e9b2e3;">Enum</span>.each lista, &amp;(<span style="color: #e9b2e3;">IO</span>.puts <span style="color: #e9b96e;">"Pessoa: </span><span style="color: #fcaf3e;">#{&amp;1}</span><span style="color: #e9b96e;">"</span>) <span style="color: #73d216;"># </span><span style="color: #73d216;">sintaxe nova !!!</span>
    <span style="color: #b4fa70;">after</span> 
     15000 -&gt; <span style="color: #e9b2e3;">IO</span>.puts <span style="color: #e9b96e;">"Sem pessoas para voc&#234;"</span>
    <span style="color: #b4fa70;">end</span>
  <span style="color: #b4fa70;">end</span>

<span style="color: #b4fa70;">end</span>
</pre>
</div>

<ol class="org-ol">
<li>Na sua sessão de shell, use a função c para compilar o arquivo. (veja a documentação com "h c").
</li>
<li>Executem as funções distribuídas: OlaMundoClient.ola :"nascimento@cs", "&lt;NOME&gt;" e OlaMundoClient.pessoas :"nascimento@cs".
</li>
</ol>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Victor Oliveira Nascimento victor.nascimento AT concretesolutions DOT com DOT br</p>
<p class="date">Created: 2015-05-14 Qui 20:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
